hyperSalineInlet/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1.5 0 0);  // Velocidad entrada 1.5 m/s en x
    }
    
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    
    walls
    {
        type            noSlip;
    }
    
    seaWater
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //