hyperSalineInlet/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293.15;  // Temperatura agua de mar (20°C)

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 313.15;  // Agua hipersalina más caliente (40°C)
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    walls
    {
        type            zeroGradient;
    }
    
    seaWater
    {
        type            fixedValue;
        value           uniform 293.15;  // Temperatura agua de mar
    }
}

// ************************************************************************* //