hyperSalineInlet/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.001;  // Valor inicial bajo

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.1;  // epsilon = Cmu^0.75 * k^1.5 / l
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    walls
    {
        type            epsilonWallFunction;
        value           uniform 0.001;
    }
    
    seaWater
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //