hyperSalineInlet/0/gamma
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      gamma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.035;  // Concentración sal agua de mar (~3.5%)

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.25;  // Concentración sal agua hipersalina (~25%)
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    walls
    {
        type            zeroGradient;
    }
    
    seaWater
    {
        type            fixedValue;
        value           uniform 0.035;  // Concentración agua de mar
    }
}

// ************************************************************************* //