hyperSalineInlet/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.01;  // Valor inicial bajo

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.05;  // k = 3/2 * (U * I)^2, I~0.05
    }
    
    outlet
    {
        type            zeroGradient;
    }
    
    walls
    {
        type            kqRWallFunction;
        value           uniform 0.01;
    }
    
    seaWater
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //