hyperSalineInlet/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-05;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 1e-05;
    }
    
    outlet
    {
        type            calculated;
        value           uniform 1e-05;
    }
    
    walls
    {
        type            nutkWallFunction;
        value           uniform 1e-05;
    }
    
    seaWater
    {
        type            calculated;
        value           uniform 1e-05;
    }
}

// ************************************************************************* //