hyperSalineInlet/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default                         none;
    
    div(rhoPhi,U)                   Gauss limitedLinearV 1;
    div(phi,alpha.seawater)         Gauss vanLeer;
    div(phirb,alpha.seawater)       Gauss linear;
    div(phi,gamma)                  Gauss vanLeer;
    div(phirb,gamma)                Gauss linear;
    div(phi,T)                      Gauss limitedLinear 1;
    div(phi,k)                      Gauss limitedLinear 1;
    div(phi,epsilon)                Gauss limitedLinear 1;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

// ************************************************************************* //