hyperSalineInlet/Allrun
#!/bin/bash
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

echo "=================================================="
echo "  OpenFOAM Hypersaline Water Injection Simulation"
echo "  Solver: interMixingFoam"
echo "=================================================="

# Generar la malla
echo "Generating mesh with blockMesh..."
runApplication blockMesh

# Verificar la malla
echo "Checking mesh quality..."
runApplication checkMesh

# Ejecutar la simulación
echo "Running interMixingFoam simulation..."
runApplication interMixingFoam

echo "=================================================="
echo "  Simulation completed!"
echo "  Results can be visualized with paraFoam"
echo "=================================================="